import React, {useCallback} from 'react'
import {Text, ScrollView} from 'react-native'
import {SafeAreaView} from 'react-native-safe-area-context'
import {NavigationHeader, Icon} from '../components'
import {useNavigation} from '@react-navigation/native'

export default function userClause() {
  const navigation = useNavigation()

  const goBack = useCallback(() => {
    navigation.canGoBack() && navigation.goBack()
  }, [])

  return (
    <SafeAreaView style={{flex: 1, backgroundColor: 'white'}}>
      <NavigationHeader
        viewStyle={[{backgroundColor: 'white'}]}
        title="사용자 이용약관"
        Left={() => (
          <Icon
            source={require('../assets/images/arrow_left.png')}
            size={30}
            onPress={goBack}
          />
        )}
      />
      <ScrollView showsVerticalScrollIndicator={false}>
        <Text>
          모모카 애플리케이션 사용자 이용약관{'\n'}
          [총칙]{'\n'}제 1 조 (목적){'\n'}본 약관은 이용고객이
          모모카(이하“회사”혹은 “모모카“라고 합니다.)가 제공하는 ”서비스“를
          이용함에 있어 회사와 이용고객 간의 권리와 의무 및 책임 사항을 규정함을
          목적으로 한다.{'\n'}
          {'\n'}제 2 조 (정의){'\n'}본 약관에서 사용하는 주요 용어는 다음과
          같습니다.
          {'\n'}
          1. ”모모카“라 함은 회사가 ”자동차 가상튜닝 시뮬레이션” 서비스 및
          자동차 튜닝 서비스를 이용고객에게 제공하기 위해여 컴퓨터
          정보통신시설비를 이용하여 재화 ,용역을 거래할 수 있도록 설정한 가상의
          영업장 또는 회사가 운영하는 웹사이트를 말하며 아울러“모모카”를
          운영하는 사업자의 의미로도 사용한다.{'\n'}
          2. "서비스"라 함은 구현되는 단말기(PC, 휴대형단말기 등의 각종 유무선
          장치를 포함)와 상관 없이 "일반회원"이 이용할 수 있는 오빠차 및 오빠차
          관련 제반 서비스를 의미합니다.{'\n'}
          3. "일반회원"이라 함은 회사의 "서비스"에 접속하여 이 약관에 따라
          "회사"와 이용계약을 체결하고 "회사"가 제공하는 "서비스"를 이용하는
          고객을 말합니다.{'\n'}
          4. "입점회원"이라 함은 회사의 "서비스"에 접속하여 "판매자 서비스 이용
          약관"에 따라 "회사"와 이용 계약을 체결하여 "회사"가 제공하는 튜닝
          서비스 이용권 상거래 플랫폼을 이용해 해당 서비스 이용권을 구매하는
          고객을 말합니다.{'\n'}
          5. "비일반회원"이라 함은 이용 계약을 체결하지 않고 회사가 제공하는
          서비스를 이용하는 자를 말합니다.{'\n'}
          6. "닉네임"이라 함은 "일반회원"의 식별과 "서비스" 이용을 위하여
          "일반회원"이 정하고 "회사"가 승인하는 문자와 숫자의 조합을 의미합니다.
          {'\n'}
          7. "비밀번호"라 함은 "일반회원"이 부여 받은 "아이디와 일치되는
          "일반회원"임을 확인하고 비밀보호를 위해 "일반회원" 자신이 정한 문자
          또는 숫자의 조합을 의미합니다.{'\n'}
          8. "게시물"이라 함은 "일반회원" 및 이용고객이 회사가 제공하는 서비스에
          게시 또는 등록하는 부호(URL 포함), 문자, 음성, 음향, 영상(동영상
          포함), 이미지(사진 포함), 파일 등을 말합니다.{'\n'}
          9. "충전권"이라 함은 "입점회원" 이 회사가 제공하는 자동차 튜닝 연결
          서비스를 이용을 위해 전자 상거래 서비스(이하 "충전권 서비스"이라
          합니다.)를 이용하여 "회사" 로부터 구매한 튜닝 서비스 이용권을
          의미합니다.{'\n'}
          10. 이 약관에서 사용하는 용어 중 본항에서 정하지 아니한 것은 관계 법령
          및 서비스별 안내에서 정하는 바에 따르며, 그 외에는 일반 관례에
          따릅니다.{'\n'}
          {'\n'}제 3 조 (약관의 게시, 효력 및 개정){'\n'}
          1. 회사는 이 약관의 내용을 일반회원이 쉽게 알 수 있도록 일반회원가입
          화면에 게시합니다.{'\n'} 2. 회사는 『약관의 규제에 관한 법률』(이하
          "약관법"), 『정보통신망 이용 촉진 및 정보보호 등에 관한 법률(이하
          "정보통신망법")』 등 관련법을 위배하지 않는 범위에서 이 약관을 개정할
          수 있습니다.{'\n'}
          3. 회사가 약관을 개정할 경우에는 적용 일자 및 개정 사유를 명시하여
          개정약관의 적용 일자 7일 전부터 적용 일자 전일 까지 공지합니다. 다만,
          일반회원에게 불리한 약관의 개정의 경우에는 개정약관의 적용 일자 30일
          전에 공지하거나 서비스내 전자우편, 전자쪽지, 로그인시 동의창 등의
          전자적 수단을 통해 따로 명확히 통지하도록 합니다. 위와 같은 공지 또는
          통지에도 불구하고 변경된 약관에 대한 정보를 알지 못해 발생하는
          일반회원의 피해는 회사에서 책임지지 않습니다.{'\n'}
          4. 개정된 약관에 동의하지 않을 경우 일반회원 탈퇴(해지)를 요청할 수
          있습니다.{'\n'}
          5. 이 약관에서 정하지 아니한 사항과 이 약관의 해석에 관하여는 『약관의
          규제 등에 관한 법률』, 『정보통신망 이용촉진 및 정보보호 등에 관한
          법률』 및 관련법령 또는 상관례에 따릅니다.{'\n'}
          {'\n'}
          [2장 서비스의 이용]{'\n'}제 4 조 (서비스 이용){'\n'}① 서비스 이용은
          회사의 서비스 사용 승낙 직후부터 가능합니다.{'\n'}② 서비스 이용시간은
          회사의 업무상 또는 기술상 불가능한 경우를 제외하고는 연중무휴 1일
          24시간(00:00-24:00)으로 함을 원칙으로 합니다. 다만, 서비스 설비의
          정기점검 등의 사유로 회사가 서비스를 특정범위로 분할하여 별도로 날짜와
          시간을 정할 수 있습니다.{'\n'}
          {'\n'}제 5 조 (서비스 내용 변경통지 등){'\n'}
          회사가 서비스 내용을 변경하거나 종료하는 경우 회사는 서비스의
          공지사항, SMS 등의 전자적 방식을 통하여 서비스 내용의 변경 사항 또는
          종료를 통지할 수 있습니다.{'\n'}
          {'\n'}제 6 조 (서비스 이용의 제한 및 중지){'\n'}① 회사는 다음 사유가
          발생한 경우에는 이용고객의 서비스 이용을 제한하거나 중지시킬 수
          있습니다.{'\n'}
          1. 이용고객이 회사 서비스의 운영을 고의 또는 중과실로 방해하는 경우
          {'\n'}
          2. 이용고객이 제8조의 의무를 위반한 경우{'\n'}
          3. 서비스용 설비 점검, 보수 또는 공사로 인하여 부득이한 경우{'\n'}
          4. 전기통신사업법에 규정된 기간통신사업자가 전기통신 서비스를 중지했을
          경우{'\n'}
          5. 국가비상사태, 서비스 설비의 장애 또는 서비스 이용의 폭주 등으로
          서비스 이용에 지장이 있는 때{'\n'}
          6. 기타 중대한 사유로 인하여 회사가 서비스 제공을 지속하는 것이
          부적당하다고 인정하는 경우{'\n'}② 회사는 “주민등록법"을 위반한
          명의도용 및 결제도용, 전화번호 도용, "저작권법" 및
          "컴퓨터프로그램보호법"을 위반한 불법프로그램의 제공 및 운영방해,
          "정보통신망법"을 위반한 불법 통신 및 해킹, 악성프로그램의 배포,
          접속권한 초과행위 등과 같이 관련법을 위반한 경우에는 즉시
          영구이용정지를 할 수 있습니다. 본 항에 따른 영구이용정지 시 서비스
          이용을 통해 획득한 혜택 등도 모두 소멸되며, 회사는 이에 대해 별도로
          보상하지 않습니다.{'\n'}③ 회사는 본 조에 따라 서비스의 이용을
          제한하거나 중지한 때에는 그 사유 및 제한 기간 등을 제5조 [서비스 내용
          변경통지 등]에 따라 이용고객에게 통지합니다.{'\n'}④ 이용고객은 본 조에
          따른 이용제한 등에 대해 회사가 정한 절차에 따라 이의신청을 할 수
          있습니다. 이 때 이의가 정당하다고 회사가 인정하는 경우 회사는 즉시
          서비스의 이용을 재개합니다.{'\n'}
          {'\n'}제 7조 (권리의 귀속 및 저작물의 이용){'\n'}① 회사가 이용고객에게
          제공하는 각종 서비스에 대한 저작권을 포함한 일체의 권리는 회사에
          귀속되며 이용고객이 서비스를 이용하는 과정에서 작성한 게시물에 대한
          저작권을 포함한 일체에 관한 권리는 별도의 의사표시가 없는 한 해당
          이용고객에게 귀속됩니다.{'\n'}② 회사 는 서비스의 운영, 전시, 전송,
          배포, 홍보 의 목적으로 이용고객의 별도의 허락 없이 무상으로 저작권법에
          규정하는 공정한 관행에 합치되게 합리적인 범위 내에서 다음과 같이
          이용고객이 등록한 게시물을 사용할 수 있습니다.{'\n'}③ 이용고객이
          서비스 내에 게시한 게시물이 타인의 저작권, 프로그램저작권 등을
          침해하였음을 이유로 회사가 타인으로부터 손해배상청구 등 이의 제기를
          받은 경우 이용고객은 회사의 면책을 위하여 노력하여야 하며, 회사가
          면책되지 못한 경우 이용고객은 그로 인해 "회사"에 발생한 모든 손해를
          부담하여야 합니다.{'\n'}④ "모모카"에서 사용하는 모든 자동차 로고와
          브랜드명, 디자인은 해당 자동차 회사의 소유이며, 모모카의 소유가
          아닙니다.{'\n'}⑤ 본 기능을 개인적인 용도로 사용하는 것을 권장 드리고,
          상업적으로 이용하실 경우 발생하는 법적인 문제에 대해서는 모모카와
          연관이 없음을 알려 드립니다.{'\n'}
          {'\n'}제 8 조 (회원 및 비회원 이용고객의 의무){'\n'}① 회원 및 비회원
          이용고객은 다음 각 호의 행위를 하여서는 안 됩니다.{'\n'}
          1. 회원정보에 허위 내용을 등록하는 행위{'\n'}
          2. 회사 기타 제3자의 명예를 훼손하거나 지적재산권을 침해하는 등 회사나
          제3자의 권리를 침해하는 행위{'\n'}
          3. 다른 회원의 회원 정보 또는 이용고객의 정보를 도용하여 부당하게
          서비스를 이용한 경우{'\n'} 4. 정크메일(junk mail), 스팸메일(spam
          mail), 행운의 편지(chain letters), 피라미드 조직에 가입할 것을
          권유하는 메일, 외설 또는 폭력적인 메시지 ·화상·음성 등이 담긴 메일을
          보내거나 기타 공서양속에 반하는 정보를 공개 또는 게시하는 행위{'\n'}
          5. 정보통신망이용촉진및정보보호등에관한법률 등 관련 법령에 의하여 그
          전송 또는 게시가 금지되는 정보(컴퓨터 프로그램 등)를 전송하거나
          게시하는 행위{'\n'}
          6. 공공질서 또는 미풍양속에 위배되는 내용의 정보, 문장, 도형, 음성
          등을 유포하는 행위{'\n'}
          7. 회사의 직원이나 서비스의 관리자를 가장하거나 사칭하여 또는 타인의
          명의를 모용하여 글을 게시하거나 메시지를 발송하는 행위{'\n'}
          8. 컴퓨터 소프트웨어, 하드웨어, 전기통신 장비의 정상적인 가동을 방해,
          파괴할 목적으로 고안된 소프트웨어 바이러스, 기타 다른 컴퓨터 코드,
          파일, 프로그램을 포함하고 있는 자료를 게시하거나 전자우편, SMS로
          발송하는 행위{'\n'}
          9. 스토킹(stalking) 등 다른 이용고객의 서비스 이용을 방해하는 행위
          {'\n'}
          10. 다른 이용고객의 개인정보를 그 동의 없이 수집, 저장, 공개하는 행위
          {'\n'}
          11. 불특정 다수의 이용고객을 대상으로 하여 광고 또는 선전을 게시하거나
          스팸메일을 전송 하는 등의 방법으로 회사에서 제공하는 서비스를 이용하여
          영리목적의 활동을 하는 행위{'\n'}
          12. 현행 법령, 회사가 제공하는 서비스에 정한 약관 기타 서비스 이용에
          관한 규정을 위반하는 행위{'\n'}② 회사는 회원 또는 비회원 이용고객이
          제1항의 행위를 하는 경우 서비스의 이용을 제한하거나 일방적으로 본
          계약을 해지할 수 있으며, 이에 대해 회사는 어떠한 책임도 지지 않습니다.
          {'\n'}③ 일반회원은 회사에서 공식적으로 인정한 경우를 제외하고는
          서비스를 이용하여 상품을 판매하는 영업 활동을 할 수 없으며, 특히,
          해킹, 광고를 통한 수익활동, 음란사이트를 통한 상업행위, 상용소프트웨어
          불법배포 등을 할 수 없습니다. 이를 위반하는 영업행위, 수익활동,
          상업행위 등에 대하여 회사는 일체의 책임을 지지 않으며, 일반회원은 이와
          같은 행위와 관련하여 회사에 발생한 손해를 배상할 의무를 집니다.{'\n'}
          {'\n'}제 9 조 (회사의 의무){'\n'}① 회사는 회사의 서비스 제공 및 보안과
          관련된 설비를 지속적이고 안정적인 서비스 제공에 적합하도록 유지, 점검
          또는 복구 등의 조치를 성실히 이행하여야 합니다.{'\n'}② 회사는
          이용고객이 원하지 아니하는 영리 목적의 광고성 전자우편이나 SMS를
          발송하지 않습니다.{'\n'}③ 회사는 서비스의 제공과 관련하여 알게 된
          이용고객의 개인정보를 본인의 승낙 없이 제3자에게 누설, 배포하지 않고,
          이를 보호하기 위하여 노력합니다. 회원의 개인정보보호에 관한 기타의
          사항은 정보통신망 이용촉진 및 정보보호등에 관한 법률 등 관계법령 및
          회사가 별도로 정한 “개인정보취급방침”에 따릅니다.{'\n'}
          {'\n'}제 10 조 (양도금지){'\n'}
          이용고객의 서비스 받을 권리는 이를 양도 내지 증여하거나 질권의
          목적으로 제공 할 수 없습니다.{'\n'}
          {'\n'}
          제11조 (위치기반서비스의 내용){'\n'}
          회사는 위치정보사업자로부터 제공받은 위치정보수집대상의 위치정보를
          이용하여 다음 각 호와 같은 내용의 위치기반서비스를 제공합니다{'\n'}
          1. 현재 위치를 활용한 검색결과 제공: 개인위치정보주체의 현 위치를
          기준으로 근거리 및 방문이 가능한 업체 등의 검색결과를 제공합니다.
          {'\n'}
          {'\n'}
          제12조 (위치 정보 수집방법){'\n'}
          회사는 다음과 같은 방식으로 개인위치정보를 수집합니다.{'\n'}
          1. 휴대폰 단말기를 이용한 기지국 기반(Cell ID방식)의 실시간 위치정보
          수집{'\n'}
          2. GPS칩이 내장된 전용 단말기를 통해 수집되는 GPS 정보를 통한 위치정보
          수집{'\n'} 3. Wi-Fi칩이 내장된 전용 단말기를 통해 수집되는 WPS 정보를
          통한 위치정보 수집 {'\n'}4. 기타 위치를 식별할 수 있는 장치를 통해
          수집되는 위치정보 수집{'\n'}
          {'\n'}
          제13조 (위치기반서비스의 이용){'\n'}① 위치기반서비스의 이용은 연중무휴
          1일 24시간을 원칙으로 합니다. 다만, 회사의 업무상이나 기술상의 이유로
          서비스가 일지 중지될 수 있고, 또한 운영상의 목적으로 회사가 정한
          기간에는 서비스가 일시 중지될 수 있습니다. 이러한 경우 회사는 사전
          또는 사후에 이를 공지합니다.{'\n'}② 회사는 위치기반서비스를 일정범위로
          분할하여 각 범위 별로 이용 가능한 시간을 별도로 정할 수 있으며 이 경우
          그 내용을 공지합니다.{'\n'}
          회사는 전시·사변·천재지변 또는 이에 준하는 국가비상사태가 발생하거나
          발생할 우려가 있는 경우와 전기통신사업법에 의한 기간통신사업자가
          전기통신서비스를 중지하는 등 기타 부득이한 사유가 있는 경우에는
          위치기반서비스의 전부 또는 일부를 제한하거나 정지할 수 있습니다.
          {'\n'}
          {'\n'}
          제14조 (8세 이하의 아동 등의 보호의무자의 권리){'\n'}① 회사는 아래의
          경우에 해당하는 자(이하 “8세 이하의 아동 등”이라 한다)의 보호의무자가
          8세 이하의 아동 등의 생명 또는 신체보호를 위하여 개인위치정보의 이용
          또는 제공에 동의하는 경우에는 본인의 동의가 있는 것으로 봅니다.{'\n'}
          1. 8세 이하의 아동{'\n'}
          2. 금치산자{'\n'}
          3. 장애인복지법 제2조 제2항 제2호의 규정에 의한 정신적 장애를 가진
          자로서 장애인고용촉진 및 직업재활법 제2조 제2호의 규정에 의한
          중증장애인에 해당하는 자(장애인 복지법 제29조의 규정에 의하여 장애인
          등록을 한 자에 한한다.){'\n'}② 8세 이하의 아동 등의 생명 또는 신체의
          보호를 위하여 개인위치정보의 이용 또는 제공에 동의를 하고자 하는
          보호의무자는 서면동의서에 보호의무자임을 증명하는 서면을 첨부하여
          회사에 제출하여야 합니다.{'\n'}③ 보호의무자는 8세 이하의 아동 등의
          개인위치정보 이용 또는 제공에 동의하는 경우 개인위치정보주체 권리의
          전부를 행사할 수 있습니다.{'\n'}
          {'\n'}제 15조 (개인정보보호){'\n'}① 회사는 회원의 개인정보를 보호하기
          위하여 정보통신망법 및 개인정보 보호법 등 관계 법령에서 정하는 바를
          준수합니다.{'\n'}② 회사는 회원의 개인정보를 보호하기 위해
          "개인정보취급방침"을 수립하고 개인정보 보호 책임자를 지정하여 이를
          게시하고 운영합니다.{'\n'}③ 회사의 공식 사이트 이외의 링크된
          사이트에서는 회사의 개인정보취급방침이 적용되지 않습니다. 링크된
          사이트 및 구매 상품이나 서비스를 제공하는 제3자의 개인정보 취급과
          관련하여는 해당 사이트 및 제3자의 개인정보취급방침을 확인할 책임이
          회원에게 있으며, 회사는 이에 대하여 책임을 부담하지 않습니다.{'\n'}④
          회사는 이용계약을 위하여 이용고객이 제공한 정보를 회사 서비스 운영을
          위한 목적 이외의 용도로 사용하거나 이용고객의 동의 없이 제3자에게
          제공하지 않습니다. 단, 다음 각 호의 경우에는 예외로 합니다.{'\n'}
          1. 법령에 근거하여 회원정보의 이용과 제3자에 대한 정보제공을 허용하고
          있는 경우{'\n'}
          2. 배송업무, 탁송업무, 서비스 예약 등에 필요한 최소한의 회원정보를
          알려 주는 경우{'\n'}
          3. 기타 회사의 약관 및 정책에 따라 이용고객의 동의를 구한 경우{'\n'}
          {'\n'}제 16 조 (이용계약의 해지){'\n'}① 회원은 언제든지 회사가 정하는
          절차에 따라 이용계약 해지 신청을 할 수 있으며, 회사는 관련법 등이
          정하는 바에 따라 이를 즉시 처리하여야 합니다.{'\n'}② 회원이 계약을
          해지할 경우, 관련법 및 회사가 별도로 정하는 “개인정보취급방침”에 따라
          회사가 회원의 개인정보 등을 보유하는 경우를 제외하고는 해지 즉시
          회원의 모든 개인정보등은 삭제됩니다.{'\n'}③ 회원이 계약을 해지하는
          경우, 회원이 작성한 게시물 중 프로필 등과 같이 본인 계정에 등록된
          게시물 일체는 삭제됩니다. 다만, 다른 회원에 의해 담기, 스크랩 등이
          되어 재게시되거나, 공용게시판에 등록된 게시물 등은 삭제되지 않으니
          사전에 삭제 후 탈퇴하시기 바랍니다.{'\n'}④ “회원”이 제8조의 규정을
          위반한 경우 회사는 회원에게 사전에 통보하거나 상당한 기간을 정하여
          의견진술의 기회를 부여한 후 본 계약을 해지할 수 있고, 이로 인하여
          서비스 운영에 손해가 발생한 경우 이에 대한 민, 형사상 책임도 물을 수
          있습니다.{'\n'}
          {'\n'}제 17 조 (면책조항){'\n'}① 회사는 다음 사유로 서비스를 제공할 수
          없는 경우 이로 인하여 회원에게 발생한 손해에 대해서는 책임을 부담하지
          않습니다.{'\n'}
          1. 천재지변 또는 이에 준하는 불가항력의 상태가 있는 경우{'\n'}
          2. 서비스 제공을 위하여 회사와 서비스 제휴계약을 체결한 제3자의
          고의적인 서비스 방해가 있는 경우{'\n'}
          3. 회원의 귀책사유로 서비스 이용에 장애가 있는 경우{'\n'}
          4. 기타 회사의 고의∙과실이 없는 사유로 인한 경우{'\n'}② 회사는
          이용고객이 서비스를 이용하여 얻은 정보, 자료, 사실의 신뢰도, 정확성
          등에 대해서는 보증을 하지 않으며 이로 인해 발생한 이용고객의 손해에
          대하여는 책임을 부담하지 않습니다.{'\n'}③ 회사를 통해 접수를 하지 않아
          전산에서 조회가 되지 않는 건에 대해 당사는 책임을 지지 않습니다.
          {'\n'}④ 회사는 이용고객이 서비스를 이용하여 기대하는 수익을 얻지
          못하거나 상실한 것에 대하여 책임을 지지 않으며, 이용고객 상호간 및
          이용고객과 제3자 상호간에 서비스를 매개로 발생한 분쟁에 대해 개입할
          의무가 없고, 이로 인한 손해를 배상할 책임도 부담하지 않습니다.{'\n'}⑤
          수리계약 및 자동차 관리 서비스 계약은 이용고객과 해당 서비스 제공 업체
          간의 계약이므로 해당 서비스 과정에서 발생한 하자의 경우 회사는
          원칙적으로 배상의 책임이 없으며, 다만 회사는 이용고객과 해당 서비스
          제공 업체간의 적극적 중재역할을 담당합니다.{'\n'}⑥ 회사는 무료로
          제공되는 서비스 이용과 관련하여 관련법에 특별한 규정이 없는 한 책임을
          지지 않습니다.{'\n'}
          {'\n'}제 18 조 (재판권 및 준거법){'\n'}본 약관은 대한민국법령에 의하여
          규정되고 이행되며, 서비스 이용과 관련하여 회사와 이용고객간에 발생한
          분쟁에 대해서는 민사소송법상의 주소지를 관할하는 법원을 합의관할로
          합니다.{'\n'}
          {'\n'}제 19 조 (게시물의 관리){'\n'}① 사이트의 게시물과 자료의 관리 및
          운영의 책임은 운영자에게 있습니다. 운영자는 항상 불량 게시물 및 자료에
          대하여 모니터링을 하여야 하며, 불량 게시물 및 자료를 발견하거나 신고를
          받으면 해당 게시물 및 자료를 삭제하고 이를 등록한 회원에게 주의를
          주어야 합니다.{'\n'}
          한편, 이용회원이 올린 게시물에 대해서는 게시자 본인에게 책임이 있으니
          회원 스스로 본 이용약관에서 위배되는 게시물을 게재해서는 안됩니다.
          {'\n'}② 정보통신윤리위원회 등 공공기관의 시정요구가 있는 경우 운영자는
          회원의 사전동의 없이 게시물을 삭제하거나 이동 할 수 있습니다.{'\n'}③
          불량게시물의 판단기준은 다음과 같습니다.{'\n'}- 다른 회원 또는
          제3자에게 심한 모욕을 주거나 명예를 손상하는 내용인 경우{'\n'}-
          공공질서 및 미풍양속에 위반되는 내용을 유포하거나 링크 시키는 경우
          {'\n'}- 불법 복제 또는 해킹을 조장하는 내용인 경우{'\n'}- 영리를
          목적으로 하는 광고일 경우{'\n'}- 범죄와 결부된다고 객관적으로 인정되는
          내용일 경우{'\n'}- 다른 이용자 또는 제3자와 저작권 등 기타 권리를
          침해하는 경우{'\n'}- 기타 관계 법령에 위배된다고 판단되는 경우{'\n'}④
          사이트 및 운영자는 게시물 등에 대하여 제3자로부터 명예훼손, 지적재산관
          등의 권리 침해를 이유로 게시중단 요청을 받은 경우 이를 임시로 게시
          중단(전송중단)할 수 있으며, 게시중단 요청자와 게시물 등록자 간에 소송,
          합의 기타 이에 준하는 관련 기관의 결정 등이 이루어져 사이트에 접수된
          경우 이에 따릅니다.{'\n'}
          {'\n'}부칙{'\n'}
          제1조. 본 약관은 2021년 7월 8일에 개정되었으며 2021년 11월 15일부터
          적용됩니다.{'\n'}
        </Text>
      </ScrollView>
    </SafeAreaView>
  )
}
